<template>
  <div class="bg-day-grey-light min-h-screen py-16">
    <div class="container mx-auto">
      <h1 class="h1 mb-16">Typography</h1>
      <div class="space-y-4">
        <div class="h1">h1</div>
        <div class="h2">h2</div>
        <div class="h3">h3</div>
        <div class="h4">h4</div>
        <div class="h5">h5</div>
        <div class="h6">h6</div>
        <div class="subtitle-1">subtitle-1</div>
        <div class="subtitle-2">subtitle-2</div>
        <div class="subtitle-2-bold">subtitle-2-bold</div>
        <div class="text-body-1">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="text-body-1-medium">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="text-body-1-bold">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="text-body-2">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="text-body-2-medium">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="text-body-2-bold">Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.."</div>
        <div class="caption-1">caption-1</div>
        <div class="caption-1-medium">caption-1-medium</div>
        <div class="caption-1-bold">caption-1-bold</div>
        <div class="caption-1-all-caps">caption-1-all-caps</div>
        <div class="caption-2">caption-2</div>
        <div class="caption-2-medium">caption2-medium</div>
        <div class="text-button-1">tetx-button-1</div>
        <div class="text-button-2">text-button-2</div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
}
</script>
